logs/dataload/hbase-data-load.log
nnection-0x25497e8c0x0, quorum=localhost:2181, baseZNode=/hbase
2016-05-09 07:53:28,345 INFO  [Thread-2-SendThread(localhost:2181)] zookeeper.ClientCnxn: Opening socket connection to server localhost/127.0.0.1:2181. Will not attempt to authenticate using SASL (unknown error)
2016-05-09 07:53:28,351 INFO  [Thread-2-SendThread(localhost:2181)] zookeeper.ClientCnxn: Socket connection established to localhost/127.0.0.1:2181, initiating session
2016-05-09 07:53:28,357 INFO  [Thread-2-SendThread(localhost:2181)] zookeeper.ClientCnxn: Session establishment complete on server localhost/127.0.0.1:2181, sessionid = 0x154947a86e40007, negotiated timeout = 40000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2016-05-09 07:58:35,474 INFO  [Thread-2] client.ConnectionManager$HConnectionImplementation: Closing master protocol: MasterService
2016-05-09 07:58:35,504 INFO  [Thread-2] client.ConnectionManager$HConnectionImplementation: Closing zookeeper sessionid=0x154947a86e40007
2016-05-09 07:58:35,508 INFO  [Thread-2] zookeeper.ZooKeeper: Session: 0x154947a86e40007 closed
2016-05-09 07:58:35,508 INFO  [Thread-2-EventThread] zookeeper.ClientCnxn: EventThread shut down
[OVERALL], RunTime(ms), 307758.0
[OVERALL], Throughput(ops/sec), 3249.3062731106907
[CLEANUP], Operations, 2.0
[CLEANUP], AverageLatency(us), 69102.5
[CLEANUP], MinLatency(us), 29.0
[CLEANUP], MaxLatency(us), 138239.0
[CLEANUP], 95thPercentileLatency(us), 138239.0
[CLEANUP], 99thPercentileLatency(us), 138239.0
[INSERT], Operations, 1000000.0
[INSERT], AverageLatency(us), 303.810597
[INSERT], MinLatency(us), 155.0
[INSERT], MaxLatency(us), 444415.0
[INSERT], 95thPercentileLatency(us), 335.0
[INSERT], 99thPercentileLatency(us), 457.0
[INSERT], Return=OK, 1000000