logs/dataload/mongo-data-load.log
01:20:05.196 [Thread-1] DEBUG org.mongodb.driver.protocol.insert - Insert completed
01:20:05.197 [Thread-1] INFO  org.mongodb.driver.connection - Closed connection [connectionId{localValue:2, serverValue:2}] to localhost:27017 because the pool has been closed.
01:20:05.197 [Thread-1] DEBUG org.mongodb.driver.connection - Closing connection connectionId{localValue:2, serverValue:2}
01:20:05.198 [cluster-ClusterId{value='573136f98b4d0f0567a1b6e9', description='null'}-localhost:27017] DEBUG org.mongodb.driver.connection - Closing connection connectionId{localValue:1, serverValue:1}
2016-05-10 01:20:05:199 75 sec: 1000000 operations; 13471.33 current ops/sec; [CLEANUP: Count=1, Max=1883, Min=1883, Avg=1883, 90=1883, 99=1883, 99.9=1883, 99.99=1883] [INSERT: Count=76338, Max=89087, Min=28, Avg=71.7, 90=100, 99=152, 99.9=933, 99.99=4175] 
[OVERALL], RunTime(ms), 75675.0
[OVERALL], Throughput(ops/sec), 13214.403700033035
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1883.0
[CLEANUP], MinLatency(us), 1883.0
[CLEANUP], MaxLatency(us), 1883.0
[CLEANUP], 95thPercentileLatency(us), 1883.0
[CLEANUP], 99thPercentileLatency(us), 1883.0
[INSERT], Operations, 1000000.0
[INSERT], AverageLatency(us), 72.372719
[INSERT], MinLatency(us), 27.0
[INSERT], MaxLatency(us), 2072575.0
[INSERT], 95thPercentileLatency(us), 113.0
[INSERT], 99thPercentileLatency(us), 206.0
[INSERT], Return=OK, 1000000